const MetroResponse = {
    arrivalCode: {
        0: '진입',
        1: '도착',
        2: '출발',
        3: '전역출발',
        4: '전역진입',
        5: '전역도착',
        99: '운행중',
    },

    metroLine: {
        1001: '1호선',
        1002: '2호선',
        1003: '3호선',
        1004: '4호선',
        1005: '5호선',
        1006: '6호선',
        1007: '7호선',
        1008: '8호선',
    },

    metroLineNumber: {
        1001: '1',
        1002: '2',
        1003: '3',
        1004: '4',
        1005: '5',
        1006: '6',
        1007: '7',
        1008: '8',
    },

    metroLineColor: {
        '1호선': '#0052A4',
        '2호선': '#00A84D',
        '3호선': '#EF7C1C',
        '4호선': '#00A5DE',
        '5호선': '#996CAC',
        '6호선': '#CD7C2F',
        '7호선': '#747F00',
        '8호선': '#E6186C',
    },
};

export default MetroResponse;
